Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: བྲམ་ཟེ་ཁོ་བོ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མི་འདོད་དེ།
en: I do not desire the highest, most complete enlightenment.

source: བྲམ་ཟེ་ཁོ་བོས་ནི་འཁོར་བ་མངོན་པར་འདོད་པའི་དོན་དུ་སྦྱིན་པ་བྱིན་ཞིང་ཚུལ་ཁྲིམས་བསྲུངས་ལ་ཆོས་ཉན་ཏོ།
en: I am someone who is engaged in saṃsāra, and that is why, great brahmin, I have made offerings, kept correct conduct, and listened to the Dharma.

source: །བྲམ་ཟེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཐོབ་པར་དཀའ་བ་ཡིན་པས་བྲམ་ཟེ་མི་དགོས་སོ།
en: Brahmin, the highest, most complete enlightenment is too difficult to attain.’ “

source: །བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་པོ་ལ་ལན་གཉིས་སུ་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་ནི་ཡང་དག་པ་ལགས་པས་བསམ་པས་སྨོན་ལམ་བཏབ་པར་བགྱི་བ་སྟེ།
en: The brahmin Samudrareṇu then addressed the king a second time: ‘Great king, the path to enlightenment is true, and therefore accomplished through sincere prayers of aspiration.

source: ལམ་དེ་ནི་སྒྲིབ་པ་མ་མཆིས་པས་རྫོགས་ཤིང་ཤིན་ཏུ་དང་བ་ལགས་སོ།
en: The path is complete and extremely clear because it has no obscurations.

source: །ལམ་དེ་ནི་ལྷག་པའི་བསམ་པས་རྣམ་པར་དག་ཅིང་དྲང་པོ་ལགས་སོ།
en: The path is perfectly pure and honest because of higher motivation.

source: །ལམ་དེ་ནི་ཉོན་མོངས་པ་བསལ་བས་གཡོ་མེད་ཅིང་དག་པ་ལགས་སོ།
en: The path is unshakable and pure because the kleśas are cleared away.

source: །ལམ་དེ་ནི་སྒྲིབ་པ་མ་མཆིས་པས་རྒྱ་ཆེ་བ་ལགས་སོ།
en: The path is vast because of the absence of obscurations.

source: །ལམ་དེ་ནི་བསམ་པ་ལས་བྱུང་བས་ཡང་དག་པར་གཞོལ་བ་ལགས་སོ།
en: The path is concentrated because of contemplation.

source: །ལམ་དེ་ནི་སྡིག་པ་ཐམས་ཅད་མི་བགྱིད་པས་འཇིགས་པ་མ་མཆིས་པ་ལགས་སོ།
en: The path is without fear because there are no bad actions on it.

source: །ལམ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡང་དག་པར་འབྱོར་པ་ལགས་སོ།
en: The path is very prosperous because of the perfection of generosity.

source: །ལམ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་བསིལ་བ་ལགས་སོ།
en: The path is calm because of the perfection of discipline.

source: །ལམ་དེ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་གཞི་མ་མཆིས་པ་ལགས་སོ།
en: The path is self-reliant because of the perfection of patience.

source: །ལམ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་བྱིན་གྱིས་བརླབས་ཀྱི་རྟེན་ལགས་སོ།
en: The path has a foundation of determination because of the perfection of diligence.

source: །ལམ་དེ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རྙོག་པ་མ་མཆིས་པ་ལགས་སོ།
en: The path is unpolluted because of the perfection of meditation.

source: །ལམ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཤིན་ཏུ་རྟོགས་པ་ལགས་སོ།
en: The path is perfectly known because of the perfection of wisdom.

source: །ལམ་དེ་ནི་སྙིང་རྗེ་ཆེན་པོས་ངོ་བོ་ཉིད་ཀྱི་ཤེས་པ་རྗེས་སུ་རྟོགས་པ་ལགས་སོ།
en: The path is perfectly lucid because of great kindness. The path has the realization of the knowledge of natures because of great compassion.

source: །ལམ་དེ་ནི་དགའ་བ་ཆེན་པོས་མཆོག་ཏུ་དགའ་བ་ཐོབ་པ་ལགས་སོ།
en: The path is perpetually blissful because of great rejoicing in the welfare of others.

source: །ལམ་དེ་ནི་བཏང་སྙོམས་ཆེན་པོས་སྙིང་པོ་དང་འཐུན་པ་ལགས་སོ།
en: The path is in harmony with the true nature because of great impartiality.

source: །ལམ་དེ་ནི་འདོད་པ་དང་། གནོད་སེམས་དང་། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་དག་མ་མཆིས་པས་ཚེར་མ་དང་བྲལ་བ་ལགས་སོ།
en: The path is free of thorns because there are no thoughts of desire, maliciousness, or aggression.

source: །ལམ་དེ་ནི་ཁོང་ཁྲོ་བའི་སེམས་མ་མཆིས་པས་བགྲོད་བདེ་བ་ལགས་སོ།
en: The path is easy to follow because there is no mind of anger.

source: །ལམ་དེ་ནི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་རྣམ་པར་རིག་པས་གཡོ་དང་བྲལ་བ་ལགས་སོ།
en: The path is devoid of deception because of the cognizance of form, sound, smell, taste, and touch.

source: །ལམ་དེ་ནི་ཁམས་དང་སྐྱེ་མཆེད་ཤིན་ཏུ་མཐོང་བས་བདུད་དང་ཕྱིར་རྒོལ་བ་ངེས་པར་བཅོམ་པ་ལགས་སོ།
en: The path defeats māras and opponents because of clearly perceiving the aggregates, the elements, and the sensory bases.

source: །ལམ་དེ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བས་བདུད་དང་བྲལ་བ་ལགས་སོ།
en: The path is free from māras because it is free from all kleśas.

source: །ལམ་དེ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བགྱིད་པ་དང་བྲལ་བས་སེམས་རྒྱ་ཆེན་པོར་མཆི་བ་ལགས་སོ།
en: The path is a vast mind because it is free from the thoughts of a śrāvaka or pratyekabuddha.

source: །ལམ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པས་སྤྲོ་བ་དང་བཅས་པ་ལགས་སོ།
en: The path has fortitude because of blessings from all the tathāgatas.

source: །ལམ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེ་དང་འཐུན་པས་རིན་པོ་ཆེ་ཆེན་པོ་ངེས་པར་སྒྲུབ་པ་ལགས་སོ།
en: The path is the accomplishment of the great jewel because it is in accord with the jewel of omniscience.

source: །ལམ་དེ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཡེ་ཤེས་ཆགས་པ་མི་མངའ་བས་རྟག་ཏུ་བསྟན་པ་ལགས་སོ།
en: The path is always revealed because the wisdom of the Bhagavat is without impediment.

source: །ལམ་དེ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་རྗེས་སུ་ཟིན་པས་དགེ་བའི་རྩ་བ་སྟོན་ཅིང་རྗེས་སུ་སྤྱད་པ་ལགས་སོ།
en: The path is the teaching and practice of wholesome roots because of being in the care of a kalyāṇamitra.

source: །ལམ་དེ་ནི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པས་མཐོ་དམན་དང་བྲལ་བ་ལགས་སོ།
en: The path has no high or low because it has eliminated attachment and aversion.

source: །ལམ་དེ་ནི་གནོད་སེམས་དང་། ཐ་བ་དང་། ཁྲོ་བ་མ་མཆིས་པས་རྡུལ་ངེས་པར་བཅོམ་པ་ལགས་སོ།
en: The path has conquered passion because there is no malice, harshness, or anger.

source: །ལམ་དེ་ནི་མི་དགེ་བ་ཐམས་ཅད་དང་བྲལ་བས་བདེ་འགྲོར་མཆི་བ་ལ་སྨན་པ་ལགས་སོ།
en: The path leads to happy existences because it is free from all nonvirtues.

source: །རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་དེ་ནི་མྱ་ངན་ལས་འདས་པའི་མཐར་ཐུག་པས་བདེ་བ་འཐོབ་པ་ལགས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་ཏུ་ཐུགས་སྐྱེད་ཅིག །
en: Great king, this path to enlightenment is the attainment of happiness because it concludes in nirvāṇa. Therefore, great king, develop the aspiration for enlightenment.’ “

source: རྒྱལ་པོས་སྨྲས་པ། བྲམ་ཟེ་དེ་བཞིན་གཤེགས་པ་འདི་ནི་སྐྱེ་དགུ་ལོ་བརྒྱད་ཁྲི་པ་རྣམས་ཀྱི་ནང་དུ་འཇིག་རྟེན་དུ་བྱུང་བས་ན་དེ་བཞིན་གཤེགས་པས་ངན་སོང་ཐམས་ཅད་ཞི་བར་མཛད་པ་མ་སྤྱོད་དེ།
en: The king said, ‘Brahmin, this tathāgata appeared in a world where beings live for 80,000 years. The Tathāgata is not able to put an end to all misfortunes.

source: སེམས་ཅན་གང་དག་གིས་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སེམས་ཅན་དེ་དག་ནི་འབྲས་བུ་ལ་གནས་པར་གྱུར།
en: The beings who plant good roots will experience their result.

source: ལ་ལས་ནི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པ་བསྒྲུབས། གང་དག་དགེ་བའི་རྩ་བ་མཆོག་ཏུ་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར།
en: There are beings who have accomplished samādhi, dhāraṇī, and acceptance, who have excellent good roots, and who will not regress from enlightenment.

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཁ་ཅིག་གིས་ནི་ལྷ་དང་མིའི་དཔལ་ཉམས་སུ་མྱོང་བར་གྱུར་ཏེ།
en: There are those who have planted good roots and experience the splendor of devas and humans.

source: སེམས་ཅན་རྣམས་རང་རང་གི་དགེ་བ་དང་།
en: Each being wanders according to his or her good or bad karma.

source: མི་དགེ་བའི་ལས་རྣམས་ཀྱིས་འཕྱན་པར་གྱུར་པས་ན་འདི་ལྟར་སེམས་ཅན་གཅིག་ཙམ་གྱི་སྡུག་བསྔལ་ཡང་རབ་ཏུ་ཞི་བར་མ་མཛད་ན་བཅོམ་ལྡན་འདས་ཀྱིས་བཏུལ་བའི་སེམས་ཅན་གང་ཞིག་ཡིན།
en: Therefore, what is a being who is trained by the Bhagavat if in this way he does not end the suffering of even one being?

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ནི་ཞིང་དུ་གྱུར་པ་འབའ་ཞིག་ཏུ་ཟད་ཀྱི་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་ལས་ཐར་བར་ནི་མི་མཛད་དོ།
en: The body of the Bhagavat is simply just a field, and he cannot free from suffering those beings who have not planted good roots. “ ‘

source: །ཁོ་བོ་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ཡང་སྤྱོད་ལ། ཁོ་བོ་ཡེ་ཤེས་ཆེན་པོ་བསགས་པ་དང་། ཆོས་ཀྱི་སྒོ་རྒྱ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པར་འཇུག་པ་དེས་སེམས་ཅན་རྣམས་འདུལ་ཞིང་སངས་རྒྱས་ཀྱི་མཛད་པ་ཡང་བྱེད་མོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་འདི་ལྟ་བུར་བྱང་ཆུབ་ཀྱི་ཕྱིར་སེམས་ཡོངས་སུ་བསྔོ་བ་འབའ་ཞིག་ནི་མི་བྱེད་དོ།
en: In developing the aspiration for enlightenment and practicing bodhisattva conduct, I will train beings and accomplish the deeds of a buddha through accumulating great wisdom and entering inconceivably vast numbers of Dharma entranceways.

source: །གལ་ཏེ་གང་གི་ཚེ་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རེག་པར་འགྱུར་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཁོ་བོས་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཞིག་འཐོབ་པར་འགྱུར་བ་ལྟ་ན་དེའི་ཚེ་ཁོ་བོ་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིང་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་སྤྱད་པར་བྱའོ།
en: However, my aspiration for enlightenment will not be dedicated solely to an afflicted buddha realm like this. I will only develop the aspiration for enlightenment and practice bodhisattva conduct if the buddha realm that I obtain, where I reach the highest, most complete enlightenment, will be a buddha realm in which I can end all the sufferings of the beings who are born there.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་མཛད་དེ།
en: Then, noble son, the tathāgata arhat samyaksam­buddha Ratnagarbha manifested a miracle.

source: དེའི་ཚེ་ཏིང་ངེ་འཛིན་མེ་ལོང་བཀོད་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ།
en: At that time, he rested in the samādhi that is called a mirror’s array.

source: །དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ཏིང་ངེ་འཛིན་མེ་ལོང་བཀོད་པ་ལ་མཉམ་པར་བཞག་པ་དང་། འདི་ལྟ་བུའི་སྣང་བ་བྱུང་བར་གྱུར་ཏེ།
en: When in that way the Bhagavat Buddha rested in the mirror’s array samādhi, light shone from his body.

source: སྣང་བ་དེས་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གི་འཇིག་རྟེན་གྱི་རྡུལ་སྙེད་དག་གི་ཡོན་ཏན་བཀོད་པ་ཐམས་ཅད་སྣང་བར་གྱུར་ཏེ། ལ་ལ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་། ལ་ལ་དག་ན་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་ཕྱིར་ཡང་དག་པར་ཞུགས་པ་དང་། གང་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ན་འདུག་ནས་བདུད་ཕམ་པར་བྱེད་པ་རྣམས་དང་། གང་དག་ན་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལོན་པར་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་རྣམས་དང་། གང་དག་ན་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས་རིང་པོ་མ་ལོན་པར་ཆོས་སྟོན་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གང་དག་ན་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཁྱབ་པ་དང་། གང་དག་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་འབྱུང་བ་མེད་པ་དང་། གང་དག་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་འབྱུང་བ་དང་སངས་རྒྱས་ཀྱི་ཞིང་གང་དག་ན་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱིས་སྟོང་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཁ་ཅིག་སྙིགས་མ་ལྔས་ཉོན་མོངས་པ་ཅན་དུ་གྱུར་པ་དང་། ཁ་ཅིག་སྙིགས་མ་ལྔ་དང་བྲལ་བའི་ཡོངས་སུ་དག་པ་དང་། ཁ་ཅིག་ན་སེམས་ཅན་མཆོག་རྣམས་དང་། ཁ་ཅིག་ན་དམན་པ་རྣམས་དང་།
en: That light illuminated realms in the ten directions that were as numerous as the particles in a thousand buddha realms.

source: ཁ་ཅིག་ན་ཚེ་རིང་བ་རྣམས་དང་། ཁ་ཅིག་ན་ཚེ་ཐུང་བ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཁ་ཅིག་མེས་འཇིག་པ་རྣམས་དང་། ཁ་ཅིག་ཆུ་དང་། ཁ་ཅིག་རླུང་གིས་འཇིག་པ་རྣམས་དང་།
en: In some of those realms, the bhagavat buddhas had passed into parinirvāṇa; in some they were preparing to pass into parinirvāṇa; in some they were bodhisattva mahāsattvas sitting at the foot of the Bodhi tree; in some they were defeating the māras; in some they were turning the wheel of the Dharma soon after attaining complete buddhahood; in some they were teaching the Dharma soon after turning the wheel of the Dharma; some buddha realms were filled with buddhas and bodhisattvas; in some, there were no śrāvakas or pratyekabuddhas; in some, there were śrāvakas and pratyekabuddhas; some buddha realms were devoid of buddhas, bodhisattvas, śrāvakas, and pratyekabuddhas; some buddha realms were afflicted with the five degeneracies; some were pure buddha realms free of the five degeneracies; in some there were supreme beings; in some there were inferior beings; in some the beings had long lives; in some they had short lives; some buddha realms were being destroyed by fire, some by water, and some by air; some were being created; and some had been created and were present.

source: ཁ་ཅིག་འཆགས་པ་རྣམས་དང་། ཁ་ཅིག་ཆགས་ཤིང་གནས་པ་དེ་དག་ཐམས་ཅད་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་ཀུན་ཏུ་སྣང་ངོ་།
en: All these were made visible by the vast, pervading light. “

source: །ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དེ་དག་མཐོང་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་པོ་ལ་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ལ་གཟིགས་ལ།
en: When the entire assembly had seen the qualities of the buddha realms, the brahmin Samudrareṇu said to the king, ‘Great king, look at the qualities arrayed in the buddha realms!

source: རྒྱལ་པོ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཐུགས་སྐྱེད་ཅིག །
en: Great king, develop the motivation to attain the highest, most complete enlightenment!

source: རྒྱལ་པོ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་ལྟ་བུ་བཞེད་པར་ཡང་གཟུང་བར་མཛོད་ཅིག །
en: Great king, choose the kind of buddha realm you wish to have!’ “

source: དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ལས་གང་གིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡོངས་སུ་འཛིན་པ་ནས།
en: King Araṇemin placed his palms together, bowed toward the Bhagavat, and spoke to the Bhagavat, making a long supplication that began, ‘Bhagavat, through what karma do bodhisattva mahāsattvas acquire a pure buddha realm?’

source: གང་གིས་སེམས་ཅན་རྣམས་བསམ་པ་ཡོངས་སུ་དག་པ་དང་། གང་གིས་སེམས་ཅན་རྣམས་ཚེ་རིང་པོར་འགྱུར་བའི་བར་དུ་རྒྱ་ཆེར་གསོལ་པ་དང་།
en: and ended with, ‘What causes beings to have pure thoughts, and what will cause beings to have a long life?’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་བྲལ་ཞིང་ཡོངས་སུ་དག་པ་དང་། སྨོན་ལམ་གྱི་དབང་གིས་ཡོངས་སུ་མ་དག་པ་ཡང་ཡོངས་སུ་འཛིན་ཏོ། །རྒྱལ་པོས་གསོལ་པ།
en: The Bhagavat said, ‘Great king, it is through the power of prayer that bodhisattva mahāsattvas acquire a pure buddha realm, free from the five degeneracies, and it is through prayer that they acquire an impure buddha realm.’ “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གྲོང་ཁྱེར་དུ་ཞུགས་ཏེ།
en: The king said, ‘Bhadanta Bhagavat, I shall return to the city and will single-mindedly think about the prayer.

source: རྩེ་གཅིག་ཏུ་མཆིས་ནས་སྨོན་ལམ་བསམ་པར་བགྱི་ཞིང་བདག་སྙིགས་མ་ལྔ་དང་བྲལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་ལྟ་བུ་ལ་དགའ་བ་དེར་དགེ་བའི་སྤྱོད་པ་འདི་དག་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: I will pray for a buddha realm that is free of the five degeneracies; I will direct those of good conduct there.’ “ ‘

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེའི་དུས་ལ་བབ་པར་ཤེས་པར་གྱིས་ཤིག །
en: Do as you deem fit, great king,’ replied the Bhagavat. “

source: རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས།
en: Noble son, King Araṇemin then bowed his head to the feet of the Bhagavat and his saṅgha of bhikṣus and circumambulated them three times.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་སྟེ་གྲོང་ཁྱེར་དུ་ཞུགས་ནས་རང་གི་ཁྱིམ་དུ་ནང་དུ་ཡང་དག་འཇོག་ལ་རྩེ་གཅིག་ཏུ་འདུག་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་སེམས་པར་བྱེད་དོ།། །།བམ་པོ་བཞི་པ།
en: He then departed from the presence of the Bhagavat, entered the city, and went into his home, where single-mindedly he sat in seclusion and contemplated the array of qualities of a buddha realm. “

source: དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་ཐུ་བོ་མིག་མི་འཛུམས་ལ་སྨྲས་པ། མིག་མི་འཛུམས་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ལ། ཁྱོད་ཀྱིས་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་གིས་དགེ་བ་སྤྱད་ཅིང་བསོད་ནམས་བསྒྲུབས་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོས་ཤིག །
en: Then the brahmin Samudrareṇu said to the crown prince Animiṣa, ‘Develop the aspiration for the highest, most complete enlightenment, practice good actions through the three ways of creating merit, and dedicate all the merit you achieve to the highest, most complete enlightenment.’ “

source: དེས་སྨྲས་པ། མཁན་པོ་བདག་ཀྱང་རང་གི་ཁྱིམ་དུ་མཆིས་ལ་གཅིག་པུ་དབེན་པར་མཆིས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་བསམ་པར་བགྱི་སྟེ།
en: The crown prince Animiṣa said, ‘Upādhyāya, I will also go to my home and alone in solitude will contemplate the array of qualities of a buddha realm.

source: གལ་ཏེ་བྱང་ཆུབ་ཀྱི་སླད་དུ་སེམས་སྐྱེ་བར་འགྱུར་བ་ལྟ་ན་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་སླར་མཆིས་ནས་བྱང་ཆུབ་ཏུ་སེམས་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: If I develop the aspiration for enlightenment, I will come again to the Bhagavat and make a dedication of the motivation to enlightenment.’ “

source: །དེ་ནས་རྒྱལ་བུ་དེས་ཀྱང་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་སོང་སྟེ།
en: Then the crown prince also bowed his head to the feet of the Bhagavat and his saṅgha of bhikṣus and circumambulated them three times.

source: རང་གི་གནས་སུ་སོང་ནས་གཅིག་ཏུ་དབེན་པར་སོང་སྟེ་འདུག་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་སེམས་པར་བྱེད་དོ།
en: He departed from the presence of the Bhagavat and entered the city and went into his home, where he stayed alone in solitude and contemplated the array of qualities in a buddha realm. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་གཉིས་པ་ལ་བོས་ཏེ་སྨྲས་པ། གཞོན་ནུ་ཁྱོད་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག་ཅེས་བྱ་བ་ནས་སྔ་མ་བཞིན་དུ་རྒྱ་ཆེར་སྦྱར་ཏེ། རྒྱལ་བུ་སྟོང་གི་བར་དུ་ཐམས་ཅད་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ།
en: Then, noble son, the court priest, the brahmin Samudrareṇu, called the second prince and said to him, ‘Prince, you should develop the aspiration for enlightenment,’ and so on, continuing until all the thousand princes had been inspired to aspire to enlightenment. “

source: །ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། གཞན་ཡང་སེམས་ཅན་དུང་ཕྱུར་ཕྲག་དགུ་དང་། བྱེ་བ་ཕྲག་གཉིས་ཀྱང་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་དང་།
en: He also caused the 84,000 minor kings and 900,000,000 other beings to aspire to enlightenment.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་ཅག་ཀྱང་རང་རང་གི་ཁྱིམ་དུ་མཆིས་ལ་གཅིག་པུ་དབེན་པར་མཆིས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་བསམ་པར་བགྱིའོ།
en: They all said, ‘We will each go to our own home and remain there alone in solitude, contemplating the array of qualities of a buddha realm.’ “

source: །དེ་སྐད་ཅེས་སྨྲས་ནས་ཐམས་ཅད་རང་རང་གི་ཁྱིམ་དག་ཏུ་དོང་སྟེ་གཅིག་པུ་དབེན་པར་འདུག་ནས་ལོ་བདུན་གྱི་བར་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་སྨོན་ལམ་སེམས་པར་བྱེད་དོ།
en: After they had said that, they all returned to their own homes where they remained alone in solitude for seven years, contemplating their prayers for an array of qualities of a buddha realm. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དུས་གཞན་ཞིག་ན་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་སེམས་ལ་འདི་ལྟ་བུའི་རྣམ་པར་རྟོག་པ་སྐྱེས་ཏེ། བདག་གིས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་། བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དང་བཅས་པ་འདི་ཡང་ལོ་བདུན་གྱི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སྤྱན་དྲངས་པས།
en: Then, noble son, at another time, the thought arose in the mind of the brahmin Samudrareṇu, ‘I have caused many hundreds of thousands of millions of trillions of beings to aspire to the highest, most complete enlightenment and for seven years I have made offerings of service to the Bhagavat Buddha and his innumerable saṅgha of bhikṣus.

source: གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བདག་གིས་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་དེ་བཞིན་དུ་སྨོན་ལམ་འདི་ཡང་འགྲུབ་པ་ལྟ་ན་དེའི་ཕྱིར་བདག་གིས་ལྷ་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་།
en: If my wish for the highest, most complete enlightenment is fulfilled and if this prayer is accomplished, then may I cause devas, asuras, gandharvas, yakṣas, rākṣasas, and kumbhāṇḍas to partake in this great offering.’ “

source: གྲུལ་བུམ་རྣམས་མཆོད་སྦྱིན་ཆེན་པོ་འདི་ལ་ཡང་དག་པར་གཟུད་པར་བྱའོ་སྙམ་མོ། །རིགས་ཀྱི་བུ་དེ་ནས་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་མཐོང་བར་འདོད་པ་དང་།
en: Then, noble son, the court priest, the brahmin Samudrareṇu, wished to see the mahārāja Vaiśravaṇa.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་གནོད་སྦྱིན་འབུམ་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས། བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: And then the mahārāja Vaiśravaṇa came, encircled by many hundreds of thousands of yakṣas in attendance, to where the brahmin Samudrareṇu was.

source: བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་མདུན་དུ་འདུག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེ་ཁྱོད་ཁོ་བོ་ལས་ཇི་ཞིག་འདོད།
en: Vaiśravaṇa approached and asked him, ‘Brahmin, what is it you wish from me?’ “

source: བྲམ་ཟེས་སྨྲས་པ། ཁྱོད་སུ་ཞིག་ཡིན། རྣམ་ཐོས་ཀྱི་བུས་སྨྲས་པ།
en: The brahmin asked, ‘Who are you?’ “

source: བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་ཀྱིས་གནོད་སྦྱིན་གྱི་བདག་པོ་རྣམ་ཐོས་ཀྱི་བུ་ཞེས་བྱ་བ་ཞིག་ཡོད་པར་ཐོས་པ་དེ་ནི་ཁོ་བོ་ཡིན་ན་བྲམ་ཟེ་བསྒོ་བ་ཅི་ཡོད།
en: Vaiśravaṇa said, ‘Great brahmin, you have heard of Vaiśravaṇa, the lord of the yakṣas. I am he. Therefore, brahmin, what is your command?

source: ཅི་ཞིག་བགྱི།
en: What do you wish me to do?’ “

source: བྲམ་ཟེས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱང་མཆོད་སྦྱིན་ཆེན་པོ་འདི་ལ་སྤྲོ་བ་སྐྱེད་ཅིག །
en: The brahmin said, ‘Listen, lord of yakṣas, you too should be eager to take part in these vast offerings.’ “ ‘

source: དེས་སྨྲས་པ། བྲམ་ཟེ་ཁྱོད་ཇི་ལྟར་འདོད་པ་དེ་ལྟར་བྱའོ། །སྨྲས་པ།
en: Brahmin, it shall be as you wish,’ he replied. “

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཁོ་བོའི་ཚིག་གིས་གནོད་སྦྱིན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ལ་འདི་སྐད་ཅེས་ཀྱང་བསྒོ་ཤིག །གལ་ཏེ་གནོད་སྦྱིན་ཁྱེད་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་པ་ལྟ་ན། ཁྱེད་ཅག་དེང་ལ་རྒྱ་མཚོའི་ཕ་རོལ་ནས་ཙན་དན་ས་མཆོག་པ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དག་ལོང་ཤིག །ཁ་ཅིག་གིས་ནི་སྤོས་སྣ་ཚོགས་དང་། ཁ་ཅིག་གིས་ནི་མེ་ཏོག་སྣ་ཚོགས་དག་ལོང་ཤིག །
en: The brahmin said, ‘Mahārāja, you should use these words of mine to make the yakṣas aspire to the highest, most complete enlightenment,’ and he instructed him to say, ‘If you yakṣas wish for the highest, most complete enlightenment, you should go to the other side of the ocean and bring gośīrṣa sandalwood and uragasāra sandalwood, and some of you should bring incense for the Bhagavat, and some various kinds of flowers.

source: ཅེས་བསྒོ་ཤིག་དང་། དེས་ཁོ་བོས་ཉིན་གཅིག་བཞིན་དུ་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱའོ།
en: Then I will offer them to the Bhagavat each day.’ “ ‘

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་བྲམ་ཟེ་དེ་ལྟར་བྱའོ་ཞེས་བྲམ་ཟེ་དེའི་ལྟར་མཉན་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏེ།
en: Brahmin, it will be so,’ Vaiśravaṇa replied to the brahmin and vanished from that place. “

source: རྔ་བོ་ཆེ་བརྡུངས་ནས་གནོད་སྦྱིན་དང་། སྲིན་པོ་དག་བསྡུས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །གང་འཛམ་བུའི་གླིང་འདི་ན་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་ཅེས་བྱ་བ་དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ལོ་བདུན་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱེད་ཀྱིས།
en: Then the mahārāja Vaiśravaṇa beat a big drum summoning the yakṣas and rākṣasas, and he said to them, ‘Friends, know that in this Jambudvīpa, the brahmin named Samudrareṇu, the chief court priest of King Araṇemin, is for seven years serving with all offerings the tathāgata arhat samyaksam­buddha Ratnagarbha and his saṅgha of bhikṣus.

source: དེའི་ཕྱིར་ཁྱེད་ཅག་གིས་དེའི་དགེ་བའི་རྩ་བ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱ་ཞིང་དགེ་བའི་རྩ་བ་དེས་ཁྱེད་ཅག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: You should rejoice in that root of merit, and with that root of merit you should develop the aspiration for the highest, most complete enlightenment.’ “

source: དེའི་ཚེ་ན་གནོད་སྦྱིན་དང་། སྲིན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ཐལ་མོ་སྦྱར་ཏེ་སྨྲས་པ། བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དང་བཅས་པ་ལ་ལོ་བདུན་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་པའི་བསོད་ནམས་ཀྱི་རྒྱུན་དང་། དགེ་བའི་རྒྱུན་གང་ཡིན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་དག་ཐམས་ཅད་ལ་བདག་ཅག་རྗེས་སུ་ཡི་རང་ངོ་།
en: At that time, many hundreds of thousands of millions of trillions of yakṣas and rākṣasas placed their palms together and said, ‘We rejoice in the accumulation of merit from the continuous merit and continuous good actions through the brahmin Samudrareṇu, for seven years honoring with all requisites the tathāgata arhat samyaksam­buddha Ratnagarbha and his saṅgha of bhikṣus.
